In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("Resource/IMDb_movies.csv", low_memory=False)
df.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000009,Miss Jerry,Miss Jerry,1894,1894-10-09,Romance,45,USA,None,Alexander Black,...,"Blanche Bayliss, William Courtenay, Chauncey D...",The adventures of a female reporter in the 1890s.,5.9,154,NaN,NaN,NaN,NaN,1.0,2.0
1,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,None,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,589,$ 2250,NaN,NaN,NaN,7.0,7.0
2,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.8,188,NaN,NaN,NaN,NaN,5.0,2.0
3,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,446,$ 45000,NaN,NaN,NaN,25.0,3.0
4,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2237,NaN,NaN,NaN,NaN,31.0,14.0

In [3]:
movies_cols= ["country", "language","worlwide_gross_income"]
df_movies= df[movies_cols].copy()
print("Shape: " + str(df_movies.shape))
df_movies.head()

Shape: (85855, 3)

            country language worlwide_gross_income
0               USA     None                   NaN
1         Australia     None                   NaN
2  Germany, Denmark      NaN                   NaN
3               USA  English                   NaN
4             Italy  Italian                   NaN

In [4]:
df_movies.dropna(inplace=True)
print("Shape: " + str(df_movies.shape))
df_movies.head()

Shape: (30856, 3)

     country       language worlwide_gross_income
79    Russia        Russian              $ 144968
165  Germany         German                $ 8811
222      USA        English              $ 772155
245      USA           None             $ 9183673
251      USA  English, None               $ 26916

In [5]:
renamed={"worlwide_gross_income":"world_gross_income"}
df_movies=df_movies.rename(columns=renamed)
df_movies.head()

     country       language world_gross_income
79    Russia        Russian           $ 144968
165  Germany         German             $ 8811
222      USA        English           $ 772155
245      USA           None          $ 9183673
251      USA  English, None            $ 26916

In [6]:
df_movies["world_gross_income"] = df_movies["world_gross_income"].replace('[\$,]', '', regex=True)
df_movies["world_gross_income"] = df_movies["world_gross_income"].replace('[A-Z]+', '', regex=True)
df_movies.head()

     country       language world_gross_income
79    Russia        Russian             144968
165  Germany         German               8811
222      USA        English             772155
245      USA           None            9183673
251      USA  English, None              26916

In [7]:
df_movies.dtypes

country               object
language              object
world_gross_income    object
dtype: object

In [8]:
df_movies["world_gross_income"]=df_movies["world_gross_income"].astype(float)
df_movies.dtypes

country                object
language               object
world_gross_income    float64
dtype: object

In [13]:
df_movies.loc[(df_movies["country"] == "USA"), "language"] = "English"
df_movies

               country       language  world_gross_income
79              Russia        Russian            144968.0
165            Germany         German              8811.0
222                USA        English            772155.0
245                USA        English           9183673.0
251                USA        English             26916.0
...                ...            ...                 ...
85847            India      Malayalam              4791.0
85850  France, Belgium         French           3507171.0
85851      Netherlands  German, Dutch           7299062.0
85853           Turkey        Turkish              2833.0
85854            Spain        Catalan             59794.0

[30856 rows x 3 columns]

In [14]:
df_movies.to_csv("Resource/IMDB_cora.csv")